---
kind: type
id: T:Autodesk.Revit.DB.CADExportOptions
source: html/a5d7698f-81cf-6536-1619-bb7c583e5f2b.htm
---
# Autodesk.Revit.DB.CADExportOptions

Generic CAD Export options.

## Syntax (C#)
```csharp
public abstract class CADExportOptions
```